================================================================================
basic ident
================================================================================

do sample

--------------------------------------------------------------------------------

(file
  (value_declaration
    (do
      (long_identifier_or_op
        (long_identifier
          (identifier))))))

================================================================================
ident with numbers
================================================================================

do wh0ar3y0u

--------------------------------------------------------------------------------

(file
  (value_declaration
    (do
      (long_identifier_or_op
        (long_identifier
          (identifier))))))

================================================================================
tick ident
================================================================================

do ``I can have anything in here ASDFAS?DFS``

--------------------------------------------------------------------------------

(file
  (value_declaration
    (do
      (long_identifier_or_op
        (long_identifier
          (identifier))))))

================================================================================
ident with leading _
================================================================================

do _yo

--------------------------------------------------------------------------------

(file
  (value_declaration
    (do
      (long_identifier_or_op
        (long_identifier
          (identifier))))))

================================================================================
long ident
================================================================================
module test = foo.bar.baz
--------------------------------------------------------------------------------

(file
  (module_abbrev
    (identifier)
    (long_identifier
      (identifier)
      (identifier)
      (identifier))))

================================================================================
long ident with tick
================================================================================
module _ = foo.bar.``baz``
--------------------------------------------------------------------------------

(file
  (module_abbrev
    (identifier)
    (long_identifier
      (identifier)
      (identifier)
      (identifier))))
